In [1]:
import numpy as np
import pandas as pd

In [2]:
train = pd.read_csv(r'E:\Coding Ninjas Machine Learning and Deep Learning\PROJECT\Logistic Regression\Titanic\training_titanic_x_y_train.csv')

In [3]:
test = pd.read_csv(r'E:\Coding Ninjas Machine Learning and Deep Learning\PROJECT\Logistic Regression\Titanic\test_titanic_x_test.csv')

## cleaning traning data

In [4]:
train.head()

,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Survived
0,2,"Weisz, Mrs. Leopold (Mathilde Francoise Pede)",female,29.0,1,0,228414,26.000,NaN,S,1
1,3,"Williams, Mr. Howard Hugh ""Harry""",male,NaN,0,0,A/5 2466,8.050,NaN,S,0
2,2,"Morley, Mr. Henry Samuel (""Mr Henry Marshall"")",male,39.0,0,0,250655,26.000,NaN,S,0
3,3,"Palsson, Mrs. Nils (Alma Cornelia Berglund)",female,29.0,0,4,349909,21.075,NaN,S,0
4,3,"Sutehall, Mr. Henry Jr",male,25.0,0,0,SOTON/OQ 392076,7.050,NaN,S,0

In [5]:
train.isnull().sum()

Pclass        0
Name          0
Sex           0
Age         132
SibSp         0
Parch         0
Ticket        0
Fare          0
Cabin       514
Embarked      1
Survived      0
dtype: int64

In [6]:
train.shape

(668, 11)

In [7]:
train.describe()

           Pclass         Age       SibSp       Parch        Fare    Survived
count  668.000000  536.000000  668.000000  668.000000  668.000000  668.000000
mean     2.296407   29.700560    0.528443    0.407186   32.064552    0.402695
std      0.831638   14.240257    1.080327    0.854695   45.320835    0.490808
min      1.000000    0.670000    0.000000    0.000000    0.000000    0.000000
25%      2.000000   21.000000    0.000000    0.000000    7.925000    0.000000
50%      3.000000   29.000000    0.000000    0.000000   14.750000    0.000000
75%      3.000000   38.250000    1.000000    0.000000   31.275000    1.000000
max      3.000000   80.000000    8.000000    6.000000  512.329200    1.000000

In [8]:
train.drop('Cabin',axis=1,inplace=True)

In [9]:
train

,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Embarked,Survived
0,2,"Weisz, Mrs. Leopold (Mathilde Francoise Pede)",female,29.0,1,0,228414,26.0000,S,1
1,3,"Williams, Mr. Howard Hugh ""Harry""",male,NaN,0,0,A/5 2466,8.0500,S,0
2,2,"Morley, Mr. Henry Samuel (""Mr Henry Marshall"")",male,39.0,0,0,250655,26.0000,S,0
3,3,"Palsson, Mrs. Nils (Alma Cornelia Berglund)",female,29.0,0,4,349909,21.0750,S,0
4,3,"Sutehall, Mr. Henry Jr",male,25.0,0,0,SOTON/OQ 392076,7.0500,S,0
...,...,...,...,...,...,...,...,...,...,...
663,2,"Ilett, Miss. Bertha",female,17.0,0,0,SO/C 14885,10.5000,S,1
664,3,"Morrow, Mr. Thomas Rowan",male,NaN,0,0,372622,7.7500,Q,0
665,3,"Bing, Mr. Lee",male,32.0,0,0,1601,56.4958,S,1
666,3,"Strandberg, Miss. Ida Sofia",female,22.0,0,0,7553,9.8375,S,0
667,3,"Murphy, Miss. Katherine ""Kate""",female,NaN,1,0,367230,15.5000,Q,1

In [10]:
train['Embarked'].value_counts()

S    484
C    133
Q     50
Name: Embarked, dtype: int64

In [11]:
minAge=min(train['Age'])
minAge

0.67

In [12]:
maxAge =max(train['Age'])
maxAge

80.0

In [13]:
meanAge= np.mean(train['Age'])
meanAge

29.700559701492537

In [14]:
train["Age"].fillna(meanAge,inplace=True)
# train["Age"].isnull().sum()

In [15]:
train.isnull().sum()

Pclass      0
Name        0
Sex         0
Age         0
SibSp       0
Parch       0
Ticket      0
Fare        0
Embarked    1
Survived    0
dtype: int64

In [16]:
train.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 668 entries, 0 to 667
Data columns (total 10 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Pclass    668 non-null    int64
 1   Name      668 non-null    object
 2   Sex       668 non-null    object
 3   Age       668 non-null    float64
 4   SibSp     668 non-null    int64
 5   Parch     668 non-null    int64
 6   Ticket    668 non-null    object
 7   Fare      668 non-null    float64
 8   Embarked  667 non-null    object
 9   Survived  668 non-null    int64
dtypes: float64(2), int64(4), object(4)
memory usage: 52.3+ KB

In [17]:
train["Embarked"].fillna('C',inplace=True)

In [18]:
train.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 668 entries, 0 to 667
Data columns (total 10 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Pclass    668 non-null    int64
 1   Name      668 non-null    object
 2   Sex       668 non-null    object
 3   Age       668 non-null    float64
 4   SibSp     668 non-null    int64
 5   Parch     668 non-null    int64
 6   Ticket    668 non-null    object
 7   Fare      668 non-null    float64
 8   Embarked  668 non-null    object
 9   Survived  668 non-null    int64
dtypes: float64(2), int64(4), object(4)
memory usage: 52.3+ KB

In [19]:
train.isnull().sum()

Pclass      0
Name        0
Sex         0
Age         0
SibSp       0
Parch       0
Ticket      0
Fare        0
Embarked    0
Survived    0
dtype: int64

In [20]:
train.head()

,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Embarked,Survived
0,2,"Weisz, Mrs. Leopold (Mathilde Francoise Pede)",female,29.00000,1,0,228414,26.000,S,1
1,3,"Williams, Mr. Howard Hugh ""Harry""",male,29.70056,0,0,A/5 2466,8.050,S,0
2,2,"Morley, Mr. Henry Samuel (""Mr Henry Marshall"")",male,39.00000,0,0,250655,26.000,S,0
3,3,"Palsson, Mrs. Nils (Alma Cornelia Berglund)",female,29.00000,0,4,349909,21.075,S,0
4,3,"Sutehall, Mr. Henry Jr",male,25.00000,0,0,SOTON/OQ 392076,7.050,S,0

In [21]:
def charToint(var):
    if var=='female':
        return 0
    else:
        return 1

In [22]:
train['Sex']=train.Sex.apply(charToint)

In [23]:
train.head()

,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Embarked,Survived
0,2,"Weisz, Mrs. Leopold (Mathilde Francoise Pede)",0,29.00000,1,0,228414,26.000,S,1
1,3,"Williams, Mr. Howard Hugh ""Harry""",1,29.70056,0,0,A/5 2466,8.050,S,0
2,2,"Morley, Mr. Henry Samuel (""Mr Henry Marshall"")",1,39.00000,0,0,250655,26.000,S,0
3,3,"Palsson, Mrs. Nils (Alma Cornelia Berglund)",0,29.00000,0,4,349909,21.075,S,0
4,3,"Sutehall, Mr. Henry Jr",1,25.00000,0,0,SOTON/OQ 392076,7.050,S,0

In [24]:
train.drop(['Name', 'Ticket'],axis=1,inplace=True)

In [25]:
train.head()

   Pclass  Sex       Age  SibSp  Parch    Fare Embarked  Survived
0       2    0  29.00000      1      0  26.000        S         1
1       3    1  29.70056      0      0   8.050        S         0
2       2    1  39.00000      0      0  26.000        S         0
3       3    0  29.00000      0      4  21.075        S         0
4       3    1  25.00000      0      0   7.050        S         0

In [26]:
train.columns

Index(['Pclass', 'Sex', 'Age', 'SibSp', 'Parch', 'Fare', 'Embarked',
       'Survived'],
      dtype='object')

In [27]:
def S(var):
    if var=='S':
        return 1
    return 0

def C(var):
    if var=='C':
        return 1
    return 0

def Q(var):
    if var=='Q':
        return 1
    return 0

In [28]:
train['Embarked_S']=train['Embarked'].apply(S)
train['Embarked_C']=train['Embarked'].apply(C)
train['Embarked_Q']=train['Embarked'].apply(Q)

In [29]:
train.head()

,Pclass,Sex,Age,SibSp,Parch,Fare,Embarked,Survived,Embarked_S,Embarked_C,Embarked_Q
0,2,0,29.00000,1,0,26.000,S,1,1,0,0
1,3,1,29.70056,0,0,8.050,S,0,1,0,0
2,2,1,39.00000,0,0,26.000,S,0,1,0,0
3,3,0,29.00000,0,4,21.075,S,0,1,0,0
4,3,1,25.00000,0,0,7.050,S,0,1,0,0

In [30]:
train.drop('Embarked',inplace=True,axis=1)

In [31]:
train.head()

,Pclass,Sex,Age,SibSp,Parch,Fare,Survived,Embarked_S,Embarked_C,Embarked_Q
0,2,0,29.00000,1,0,26.000,1,1,0,0
1,3,1,29.70056,0,0,8.050,0,1,0,0
2,2,1,39.00000,0,0,26.000,0,1,0,0
3,3,0,29.00000,0,4,21.075,0,1,0,0
4,3,1,25.00000,0,0,7.050,0,1,0,0

In [32]:
train.isnull().sum()

Pclass        0
Sex           0
Age           0
SibSp         0
Parch         0
Fare          0
Survived      0
Embarked_S    0
Embarked_C    0
Embarked_Q    0
dtype: int64

In [33]:
train.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 668 entries, 0 to 667
Data columns (total 10 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Pclass      668 non-null    int64
 1   Sex         668 non-null    int64
 2   Age         668 non-null    float64
 3   SibSp       668 non-null    int64
 4   Parch       668 non-null    int64
 5   Fare        668 non-null    float64
 6   Survived    668 non-null    int64
 7   Embarked_S  668 non-null    int64
 8   Embarked_C  668 non-null    int64
 9   Embarked_Q  668 non-null    int64
dtypes: float64(2), int64(8)
memory usage: 52.3 KB

In [34]:
train['Embarked_S'].value_counts()

1    484
0    184
Name: Embarked_S, dtype: int64

In [35]:
train['Embarked_C'].value_counts()

0    534
1    134
Name: Embarked_C, dtype: int64

In [36]:
train['Embarked_Q'].value_counts()

0    618
1     50
Name: Embarked_Q, dtype: int64

In [37]:
from sklearn.preprocessing import StandardScaler
from sklearn.linear_model import LogisticRegression

In [38]:
X = train[['Pclass', 'Sex', 'Age', 'SibSp', 'Parch', 'Fare', 'Embarked_S','Embarked_C','Embarked_Q']]
y = train['Survived']

In [39]:
SC= StandardScaler()

In [40]:
SC.fit(X)

StandardScaler()

In [42]:
X_fit_train = SC.transform(X)

In [61]:
X_fit_test =SC.transform(test)

In [62]:
algo=LogisticRegression()

In [63]:
algo.fit(X_fit_train,y)

LogisticRegression()

## cleaning test data

In [46]:
test.head()

,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,2,"Davies, Master. John Morgan Jr",male,8.0,1,1,C.A. 33112,36.7500,NaN,S
1,1,"Leader, Dr. Alice (Farnham)",female,49.0,0,0,17465,25.9292,D17,S
2,3,"Kilgannon, Mr. Thomas J",male,NaN,0,0,36865,7.7375,NaN,Q
3,2,"Jacobsohn, Mrs. Sidney Samuel (Amy Frances Chr...",female,24.0,2,1,243847,27.0000,NaN,S
4,1,"McGough, Mr. James Robert",male,36.0,0,0,PC 17473,26.2875,E25,S

In [48]:
test.drop(['Name','Cabin','Ticket'],axis=1,inplace=True)

In [49]:
test.head()

   Pclass     Sex   Age  SibSp  Parch     Fare Embarked
0       2    male   8.0      1      1  36.7500        S
1       1  female  49.0      0      0  25.9292        S
2       3    male   NaN      0      0   7.7375        Q
3       2  female  24.0      2      1  27.0000        S
4       1    male  36.0      0      0  26.2875        S

In [50]:
test.isnull().sum()

Pclass       0
Sex          0
Age         45
SibSp        0
Parch        0
Fare         0
Embarked     1
dtype: int64

In [51]:
test['Sex']=test.Sex.apply(charToint)

In [53]:
test['Embarked_S']=test['Embarked'].apply(S)
test['Embarked_C']=test['Embarked'].apply(C)
test['Embarked_Q']=test['Embarked'].apply(Q)

In [56]:
test.drop(['Embarked'],axis=1,inplace=True)

In [58]:
test.fillna(test.Age.mean(),inplace=True)

In [59]:
test.isnull().sum()

Pclass        0
Sex           0
Age           0
SibSp         0
Parch         0
Fare          0
Embarked_S    0
Embarked_C    0
Embarked_Q    0
dtype: int64

In [60]:
test.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 223 entries, 0 to 222
Data columns (total 9 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Pclass      223 non-null    int64
 1   Sex         223 non-null    int64
 2   Age         223 non-null    float64
 3   SibSp       223 non-null    int64
 4   Parch       223 non-null    int64
 5   Fare        223 non-null    float64
 6   Embarked_S  223 non-null    int64
 7   Embarked_C  223 non-null    int64
 8   Embarked_Q  223 non-null    int64
dtypes: float64(2), int64(7)
memory usage: 15.8 KB

In [64]:
# prediction

In [67]:
y

0      1
1      0
2      0
3      0
4      0
      ..
663    1
664    0
665    1
666    0
667    1
Name: Survived, Length: 668, dtype: int64

In [65]:
prediction = algo.predict(X_fit_test)

In [66]:
prediction

array([0, 1, 0, 1, 0, 0, 0, 0, 1, 0, 1, 0, 1, 1, 0, 0, 0, 0, 0, 1, 1, 0,
       1, 1, 0, 1, 0, 0, 1, 1, 0, 0, 0, 0, 0, 1, 1, 0, 0, 0, 1, 0, 0, 0,
       1, 1, 0, 1, 0, 0, 0, 1, 1, 1, 0, 0, 0, 0, 0, 0, 0, 0, 1, 1, 1, 0,
       0, 1, 1, 0, 0, 0, 1, 0, 0, 1, 1, 0, 0, 0, 0, 1, 0, 0, 0, 1, 1, 1,
       0, 0, 1, 0, 0, 1, 0, 0, 0, 0, 0, 1, 1, 0, 1, 0, 1, 1, 0, 0, 0, 0,
       0, 1, 1, 0, 1, 0, 0, 1, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 1, 0, 0,
       0, 0, 0, 0, 1, 1, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 1, 1, 0, 0, 0,
       1, 0, 0, 1, 0, 0, 0, 1, 1, 1, 1, 0, 1, 0, 1, 1, 1, 1, 1, 0, 1, 0,
       0, 0, 0, 1, 0, 0, 0, 1, 1, 0, 1, 0, 1, 0, 0, 0, 1, 0, 0, 1, 1, 1,
       1, 1, 0, 1, 0, 0, 0, 0, 0, 0, 1, 1, 0, 1, 0, 0, 1, 1, 0, 0, 0, 0,
       1, 0, 0], dtype=int64)

In [68]:
algo.predict_proba(X_fit_test)

array([[0.65112472, 0.34887528],
       [0.12589441, 0.87410559],
       [0.85340695, 0.14659305],
       [0.25066915, 0.74933085],
       [0.55145206, 0.44854794],
       [0.76472653, 0.23527347],
       [0.83220601, 0.16779399],
       [0.8534088 , 0.1465912 ],
       [0.27533173, 0.72466827],
       [0.8940876 , 0.1059124 ],
       [0.23890186, 0.76109814],
       [0.8941734 , 0.1058266 ],
       [0.03450449, 0.96549551],
       [0.31559354, 0.68440646],
       [0.76787058, 0.23212942],
       [0.73410527, 0.26589473],
       [0.85771282, 0.14228718],
       [0.82840025, 0.17159975],
       [0.86250629, 0.13749371],
       [0.20763599, 0.79236401],
       [0.35237753, 0.64762247],
       [0.86423509, 0.13576491],
       [0.16943744, 0.83056256],
       [0.21490159, 0.78509841],
       [0.89424563, 0.10575437],
       [0.48795884, 0.51204116],
       [0.72912931, 0.27087069],
       [0.66964762, 0.33035238],
       [0.21941491, 0.78058509],
       [0.30882059, 0.69117941],
       [0.68856866, 0.31143134],
       [0.99123851, 0.00876149],
       [0.8798508 , 0.1201492 ],
       [0.76529444, 0.23470556],
       [0.90038577, 0.09961423],
       [0.13673377, 0.86326623],
       [0.18983596, 0.81016404],
       [0.62403771, 0.37596229],
       [0.8877988 , 0.1122012 ],
       [0.65334292, 0.34665708],
       [0.29171164, 0.70828836],
       [0.86245371, 0.13754629],
       [0.68920211, 0.31079789],
       [0.88780568, 0.11219432],
       [0.30662947, 0.69337053],
       [0.30679043, 0.69320957],
       [0.93690877, 0.06309123],
       [0.29168009, 0.70831991],
       [0.7469349 , 0.2530651 ],
       [0.82313129, 0.17686871],
       [0.85000361, 0.14999639],
       [0.21386126, 0.78613874],
       [0.20566046, 0.79433954],
       [0.08024515, 0.91975485],
       [0.9152106 , 0.0847894 ],
       [0.93627735, 0.06372265],
       [0.68648468, 0.31351532],
       [0.90894339, 0.09105661],
       [0.87180221, 0.12819779],
       [0.89819352, 0.10180648],
       [0.83768411, 0.16231589],
       [0.64882372, 0.35117628],
       [0.13979567, 0.86020433],
       [0.29174115, 0.70825885],
       [0.16524987, 0.83475013],
       [0.94425269, 0.05574731],
       [0.89847651, 0.10152349],
       [0.3987542 , 0.6012458 ],
       [0.05332605, 0.94667395],
       [0.66023781, 0.33976219],
       [0.85312119, 0.14687881],
       [0.89160009, 0.10839991],
       [0.48293858, 0.51706142],
       [0.89141618, 0.10858382],
       [0.9022876 , 0.0977124 ],
       [0.08503648, 0.91496352],
       [0.2489287 , 0.7510713 ],
       [0.76100581, 0.23899419],
       [0.70073469, 0.29926531],
       [0.95072378, 0.04927622],
       [0.72740579, 0.27259421],
       [0.35826184, 0.64173816],
       [0.95315704, 0.04684296],
       [0.76287297, 0.23712703],
       [0.88605942, 0.11394058],
       [0.32409636, 0.67590364],
       [0.42727057, 0.57272943],
       [0.41695762, 0.58304238],
       [0.86246773, 0.13753227],
       [0.8941734 , 0.1058266 ],
       [0.37422347, 0.62577653],
       [0.95828234, 0.04171766],
       [0.89886335, 0.10113665],
       [0.33261256, 0.66738744],
       [0.85340818, 0.14659182],
       [0.77102034, 0.22897966],
       [0.93868592, 0.06131408],
       [0.56959343, 0.43040657],
       [0.92587886, 0.07412114],
       [0.03469446, 0.96530554],
       [0.29171164, 0.70828836],
       [0.8939938 , 0.1060062 ],
       [0.06848835, 0.93151165],
       [0.95839671, 0.04160329],
       [0.11653766, 0.88346234],
       [0.05235923, 0.94764077],
       [0.90700539, 0.09299461],
       [0.85061806, 0.14938194],
       [0.99123851, 0.00876149],
       [0.86243208, 0.13756792],
       [0.84302884, 0.15697116],
       [0.12232405, 0.87767595],
       [0.23173883, 0.76826117],
       [0.59692575, 0.40307425],
       [0.40863732, 0.59136268],
       [0.82170797, 0.17829203],
       [0.86295489, 0.13704511],
       [0.29171164, 0.70828836],
       [0.93507119, 0.06492881],
       [0.8941734 , 0.1058266 ],
       [0.8942071 , 0.1057929 ],
       [0.8941734 , 0.1058266 ],
       [0.90571161, 0.09428839],
       [0.86680653, 0.13319347],
       [0.40128071, 0.59871929],
       [0.88834644, 0.11165356],
       [0.89937068, 0.10062932],
       [0.77102034, 0.22897966],
       [0.96279414, 0.03720586],
       [0.48781114, 0.51218886],
       [0.93399086, 0.06600914],
       [0.85288215, 0.14711785],
       [0.8488779 , 0.1511221 ],
       [0.84926719, 0.15073281],
       [0.77612568, 0.22387432],
       [0.89423864, 0.10576136],
       [0.35471479, 0.64528521],
       [0.48943589, 0.51056411],
       [0.2753976 , 0.7246024 ],
       [0.65011677, 0.34988323],
       [0.85543051, 0.14456949],
       [0.87983673, 0.12016327],
       [0.53091996, 0.46908004],
       [0.87871223, 0.12128777],
       [0.80604926, 0.19395074],
       [0.87118213, 0.12881787],
       [0.84804483, 0.15195517],
       [0.77929359, 0.22070641],
       [0.29170248, 0.70829752],
       [0.12467278, 0.87532722],
       [0.03190587, 0.96809413],
       [0.65505574, 0.34494426],
       [0.53283063, 0.46716937],
       [0.87140807, 0.12859193],
       [0.18584766, 0.81415234],
       [0.84960749, 0.15039251],
       [0.7189326 , 0.2810674 ],
       [0.21861474, 0.78138526],
       [0.84802833, 0.15197167],
       [0.83048823, 0.16951177],
       [0.89415615, 0.10584385],
       [0.1280135 , 0.8719865 ],
       [0.33587061, 0.66412939],
       [0.29171164, 0.70828836],
       [0.04288189, 0.95711811],
       [0.85779635, 0.14220365],
       [0.48577319, 0.51422681],
       [0.89418692, 0.10581308],
       [0.31893388, 0.68106612],
       [0.35373539, 0.64626461],
       [0.15963061, 0.84036939],
       [0.40514163, 0.59485837],
       [0.34999923, 0.65000077],
       [0.60682154, 0.39317846],
       [0.11825195, 0.88174805],
       [0.86256177, 0.13743823],
       [0.9079447 , 0.0920553 ],
       [0.83768411, 0.16231589],
       [0.88597475, 0.11402525],
       [0.19328393, 0.80671607],
       [0.88388614, 0.11611386],
       [0.85543051, 0.14456949],
       [0.95519328, 0.04480672],
       [0.35859225, 0.64140775],
       [0.24028799, 0.75971201],
       [0.92911936, 0.07088064],
       [0.38582764, 0.61417236],
       [0.76084998, 0.23915002],
       [0.05985266, 0.94014734],
       [0.90233319, 0.09766681],
       [0.85270653, 0.14729347],
       [0.88377928, 0.11622072],
       [0.1639887 , 0.8360113 ],
       [0.89415615, 0.10584385],
       [0.92100187, 0.07899813],
       [0.3412326 , 0.6587674 ],
       [0.03018736, 0.96981264],
       [0.44192024, 0.55807976],
       [0.20118692, 0.79881308],
       [0.06725852, 0.93274148],
       [0.8534051 , 0.1465949 ],
       [0.42298258, 0.57701742],
       [0.86254425, 0.13745575],
       [0.64987739, 0.35012261],
       [0.8534051 , 0.1465949 ],
       [0.91816684, 0.08183316],
       [0.89715441, 0.10284559],
       [0.8798357 , 0.1201643 ],
       [0.15560523, 0.84439477],
       [0.45949701, 0.54050299],
       [0.91344912, 0.08655088],
       [0.30731904, 0.69268096],
       [0.70494609, 0.29505391],
       [0.71870899, 0.28129101],
       [0.2454765 , 0.7545235 ],
       [0.12264284, 0.87735716],
       [0.85767975, 0.14232025],
       [0.89415615, 0.10584385],
       [0.88656545, 0.11343455],
       [0.63531826, 0.36468174],
       [0.03437452, 0.96562548],
       [0.93410738, 0.06589262],
       [0.83002445, 0.16997555]])

In [69]:
np.savetxt(r'E:\Coding Ninjas Machine Learning and Deep Learning\PROJECT\Logistic Regression\Titanic\solution.csv',prediction,fmt='%1.5f',)

In [70]:
algo.score(X_fit_train,y)

0.7904191616766467